#pragma once
// 단축키
//1. 컨 + D : 한줄복제
//2. 컨 + 화살표 : 단어 단위로 이동
//3. 알트 + 시프트 + 화살표 : 세로로 블록 잡기
//4. 컨 + 스페이스 : 자동완성창 띄우기(인텔리센스)
//5. 알트 + 화살표 위아래 : 현재 줄을 위아래로 옮기기
//6. F5 : 디버그로 시작
//7. F9 : 브레이크포인트 설정 / 해제->멈추는 것 보다 해당 행 메모리에 어떤 데이터가 있는지 확인 할 수 있어 유용하다.
//8. F10 : 이후 다음 행 실행 

/* *printf 사용예시

    printf("Hello World!\n헬로 월드\n");    // \n 줄바꿈
    printf("Hello World!\t헬로 월드\n");    // \t 탭
    printf("Hello\t\t헬로 월드\n");
    printf("\'Hello World!\'\n");   // 작은 따옴표
    printf("\"Hello World!\"\n");   // 큰 따옴표
    printf("\\Hello World!\\\n");   // \(백 슬래시)
*/