

// 간단 실습 
// 1. 템플릿을 이용한 계산기 클래스 만들기
//	- Add,Sub,Multiple,Divid
//	- int * int, float * int, int * float, float * float 가능해야함
// 2. BitFlag용 비트 연산자 추가 하기
//	-&, |=, &=

// 트리(tree)
// - 특징
//	- 부모 - 자식 관계를 가지는 게층적 구조를 나타내는 구조
//	- 하나의 Root(뿌리) 에서 시작하여

// set (집합)
// - 자동 정렬, 중복 안됨, 탐색 속도 빠름(레드-블랙트리 알고리즘, O(logN))
// - 사용처
//		- 데이터의 유일성, 정렬, 빠른 검색이 필요할 때 유용
//

// map
// - key와 value를 쌍으로 묶어 저장, 키는 중복 금지, 자동 정렬, 빠른 탐색
// - 사용처 
//		- 데이터에 중복이 없는 키 값이 설정 되어 있고 필요할 때 빠르게 찾아야 하는 경우 유용
//		- 리소스 관리자, 데이터 드리븐, 다국어 지원 등등
// 

// unordered_map
// - key와 Value를 쌍으로 묶어 저장, 키는 중복금지, 빠른 탐색(해시테이블(O(1)))
//